cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
/**
  * @file    WB_LCD.c 
  * @author  WB R&D Team - openmcu666
  * @version V1.0
  * @date    2016.06.10
  * @brief   LCD Driver
	* @description 红牛7.0寸LCD屏的驱动(驱动IC为SSD1963)
  */
//#include "dwgl_WB_LCD.h"
#include "stm32f10x.h"

#define  Font_Size 16                 		                       // 默认字体为16*8 
#define  XY        1											                       //文字支持横竖屏切换,竖屏:0;横屏:1

                                               
/*********************************************************
** Function name:       void Delay_10ms (u32 nCount)
** Descriptions:        LCD延时函数 10MS
** input parameters:    nCount
** output parameters:   无
** Returned value:      无
*********************************************************/
void Delay_10ms (u32 nCount)
{
	volatile int i;	 	
	for (i=0;i<nCount*800;i++);
}

/*********************************************************************************
** Function name:     void LCD_WriteReg(uint16_t LCD_Reg ,uint16_t LCD_RegValue)
** Descriptions:      配置寄存器
** input parameters:  寄存器地址:LCD_Reg   数据:RegValue
** output parameters: 无
** Returned value:    无
**********************************************************************************/
void LCD_WriteReg(uint16_t LCD_Reg ,uint16_t LCD_RegValue) 
{
	LCD_WR_REG(LCD_Reg);                    //写寄存器
  LCD_WE_RAM(LCD_RegValue);	            //写数据
			    
}

/*********************************************************
** Function name:       void LCD_WriteRAM_Prepare(void)
** Descriptions:        开始写GRAM
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************/
void LCD_WriteRAM_Prepare(void)
{
	LCD_WR_REG(0x2C);
}

/*********************************************************
** Function name:       uint16_t Read_LCDReg(uint16_t LCD_Reg)
** Descriptions:        读寄存器
** input parameters:    LCD_Reg:寄存器
** output parameters:   无
** Returned value:      返回寄存器值
*********************************************************/
uint16_t Read_LCDReg(uint16_t LCD_Reg)
{
	uint16_t temp;

	LCD_REG= LCD_Reg;
 
	temp= LCD_RAM; 
  
  return temp;		
}

/*********************************************************
** Function name:       u16 LCD_ReadRAM(void)
** Descriptions:        读RAM
** input parameters:    None
** output parameters:   None
** Returned value:      返回寄存器值
*********************************************************/
u16 LCD_ReadRAM(void)
{
  u16 dummy;
 
  LCD_REG = 0x002e; // Select GRAM Reg 
 
  dummy = LCD_RAM;  // Read 16-bit Reg 
  return dummy;
}
/**********************************************************************************
** Function name:       void LCD_Configuration(void)
** Descriptions:        LCD相关引脚配置
** input parameters:  	无
** output parameters:   无
** Returned value:      无
************************************************************************************/
void LCD_IOConfig(void)
{
	 GPIO_InitTypeDef GPIO_InitStructure;


  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE |
                         RCC_APB2Periph_AFIO, ENABLE);

  /* Set PD.00(D2), PD.01(D3), PD.04(NOE), PD.05(NWE), PD.08(D13), PD.09(D14),
     PD.10(D15), PD.14(D0), PD.15(D1) as alternate 
     function push pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 |
                                GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  /* Set PE.07(D4), PE.08(D5), PE.09(D6), PE.10(D7), PE.11(D8), PE.12(D9), PE.13(D10),
     PE.14(D11), PE.15(D12) as alternate function push pull */
//   GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | 
//                                 GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | 
//                                 GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | 
                                GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
  GPIO_Init(GPIOE, &GPIO_InitStructure);
//  GPIO_WriteBit(GPIOE, GPIO_Pin_6, Bit_SET);
  /* Set PF.00(A0 (RS)) as alternate function push pull */
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
//   GPIO_Init(GPIOF, &GPIO_InitStructure);
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;    //控制LCD_RS
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  /* Set PG.12(NE4 (LCD/CS)) as alternate function push pull - CE3(LCD /CS) */
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
//   GPIO_Init(GPIOG, &GPIO_InitStructure);
}

/**********************************************************************************
** Function name:       void FSMC_LCDInit(void)
** Descriptions:        FSMC时序配置
** input parameters:  	无
** output parameters:   无
** Returned value:      无
************************************************************************************/
void FSMC_LCDInit(void)
{
	FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;	   	//定义一个NOR初始化结构体
	FSMC_NORSRAMTimingInitTypeDef  w,r;						          //定义一个NOR时序初始化结构体

 	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);						//使能FSMC总线时钟

// //   w.FSMC_AddressSetupTime = 0x00;							                  //地址建立时间：0x1
// //   w.FSMC_AddressHoldTime = 0x00;							                  //地址保持时间：0x00
// //   w.FSMC_DataSetupTime = 0x01;							                    //数据建立时间：0x2
// //   w.FSMC_BusTurnAroundDuration = 0x00;
// //   w.FSMC_CLKDivision = 0x00;
// //   w.FSMC_DataLatency = 0x00;
// //   w.FSMC_AccessMode = FSMC_AccessMode_B;

// // 	r.FSMC_AddressSetupTime = 0x00;							                   //地址建立时间：0x1
// //   r.FSMC_AddressHoldTime = 0x00;							                   //地址保持时间：0x00
// //   r.FSMC_DataSetupTime = 0x07;							                     //数据建立时间：0x2
// //   r.FSMC_BusTurnAroundDuration = 0x00;
// //   r.FSMC_CLKDivision = 0x00;
// //   r.FSMC_DataLatency = 0x0f;
// //   r.FSMC_AccessMode = FSMC_AccessMode_B;
// 	
  w.FSMC_AddressSetupTime = 0x01;							                  //地址建立时间：0x1
  w.FSMC_AddressHoldTime = 0x01;							                  //地址保持时间：0x00
  w.FSMC_DataSetupTime = 0x01;							                    //数据建立时间：0x2
  w.FSMC_BusTurnAroundDuration = 0x00;
  w.FSMC_CLKDivision = 0x00;
  w.FSMC_DataLatency = 0x01;
  w.FSMC_AccessMode = FSMC_AccessMode_B;

