cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
	r.FSMC_AddressSetupTime = 0x01;							                   //地址建立时间：0x1
  r.FSMC_AddressHoldTime = 0x01;							                   //地址保持时间：0x00
  r.FSMC_DataSetupTime = 0x07;							                     //数据建立时间：0x2
  r.FSMC_BusTurnAroundDuration = 0x00;
  r.FSMC_CLKDivision = 0x00;
  r.FSMC_DataLatency = 0x07;
  r.FSMC_AccessMode = FSMC_AccessMode_B;
	
  FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;	   	//扩展NOR BANK 的第1个子BANK
  FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;//不使用总线复用
																	                                            
  FSMC_NORSRAMInitStructure.FSMC_MemoryType = FSMC_MemoryType_NOR;//扩展类型为NOR FLASH
  FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;//扩展总线宽度为16位
																	                                          
  FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
																	
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
																	
  FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
  FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
  FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Enable;
  FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
  FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &r;	  	
  FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &w;	  
 
  FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure); 							//根据指定参数初始化结构体
  										
  FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE); 							//使能FSMC_Bank1_NORSRAM4 内存
	
// 	
//   FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
//   FSMC_NORSRAMTimingInitTypeDef  p;

/*-- FSMC Configuration ------------------------------------------------------*/
/*----------------------- SRAM Bank 4 ----------------------------------------*/
  /* FSMC_Bank1_NORSRAM4 configuration */
//   p.FSMC_AddressSetupTime = 0;
//   p.FSMC_AddressHoldTime = 0;
//   p.FSMC_DataSetupTime = 2;
//   p.FSMC_BusTurnAroundDuration = 0;
//   p.FSMC_CLKDivision = 0xf;
//   p.FSMC_DataLatency = 0;
//   p.FSMC_AccessMode = FSMC_AccessMode_A;

//   /* Color LCD configuration ------------------------------------
//      LCD configured as follow:
//         - Data/Address MUX = Disable
//         - Memory Type = SRAM
//         - Data Width = 16bit
//         - Write Operation = Enable
//         - Extended Mode = Enable
//         - Asynchronous Wait = Disable */
//   FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;
//   FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_MemoryType = FSMC_MemoryType_SRAM;
//   FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;
//   FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
//   FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
//   FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
//   FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
//   FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &p;
//   FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &p;

//   FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);  

//   /* BANK 4 (of NOR/SRAM Bank 1~4) is enabled */
//   FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);

}
/**********************************************************************************
** Function name:       void LCD_Init(void)
** Descriptions:        LCD初始化
** input parameters:  	无
** output parameters:   无
** Returned value:      无
************************************************************************************/
// void LCD_WR_REG(uint16_t reg)
// {
// // 	GPIO_SetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
// // 	GPIO_ResetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
// 	u8 DH,DL;
// 	DH=(reg>>8);
// 	DL=(reg&0XFF);
//  	GPIO_ResetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	GPIOSPI_Send_BYTE(DH);
// 	GPIOSPI_Send_BYTE(DL);
//  	GPIO_SetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	
// // 	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
//  	GPIO_ResetBits(LCD_RS_PORT, LCD_RS_PIN);	//写命令
//  	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
//  	GPIO_ResetBits(LCD_WR_PORT, LCD_WR_PIN);
//  	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);
//  	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);

// }

// void LCD_WE_RAM(uint16_t data)
// {
// 	u8 DH,DL;
// 	DH=(data>>8);
// 	DL=(data&0XFF);
// // 	GPIO_ResetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	  GPIOC->BRR = SPI2_CS_PIN;

// 	GPIOSPI_Send1_BYTE(DH);
// 	GPIOSPI_Send1_BYTE(DL);
// // 	GPIO_SetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	  GPIOC->BSRR = SPI2_CS_PIN;

// // 	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
// 	  GPIOC->BSRR = LCD_RS_PIN;
// // 	GPIO_ResetBits(LCD_RS_PORT, LCD_RS_PIN);	//写命令
// // 	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
// 	  GPIOB->BRR = LCD_CS1_PIN;
// // 	GPIO_ResetBits(LCD_WR_PORT, LCD_WR_PIN);
// 	  GPIOD->BRR = LCD_WR_PIN;
// // 	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);
// 	  GPIOD->BSRR = LCD_WR_PIN;
// // 	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
// 	  GPIOB->BSRR = LCD_CS1_PIN;
// }
// void LCD_WR_REG(uint16_t reg)
// {
// // 	GPIO_SetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
// // 	GPIO_ResetBits(SPI2_MISO_PORT, SPI2_MISO_PIN);
// 	u8 DH,DL;
// 	DH=(reg>>8);
// 	DL=(reg&0XFF);
//  	GPIO_ResetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	GPIOSPI_Send_BYTE(DH);
// 	GPIOSPI_Send_BYTE(DL);
//  	GPIO_SetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	
// // 	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
//  	GPIO_ResetBits(LCD_RS_PORT, LCD_RS_PIN);	//写命令
// // 	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
//  	GPIO_ResetBits(LCD_WR_PORT, LCD_WR_PIN);
//  	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);
// // 	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);

// }

// void LCD_WE_RAM(uint16_t data)
// {
// 	u8 DH,DL;
// 	DH=(data>>8);
// 	DL=(data&0XFF);
// // 	GPIO_ResetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	  GPIOC->BRR = SPI2_CS_PIN;

// 	GPIOSPI_Send1_BYTE(DH);
// 	GPIOSPI_Send1_BYTE(DL);
// // 	GPIO_SetBits(SPI2_CS_PORT, SPI2_CS_PIN);
// 	  GPIOC->BSRR = SPI2_CS_PIN;

// // 	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
// 	  GPIOC->BSRR = LCD_RS_PIN;
// // 	GPIO_ResetBits(LCD_RS_PORT, LCD_RS_PIN);	//写命令
// // 	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
// //	  GPIOB->BRR = LCD_CS1_PIN;
// // 	GPIO_ResetBits(LCD_WR_PORT, LCD_WR_PIN);
// 	  GPIOD->BRR = LCD_WR_PIN;
// 	  GPIOD->BRR = LCD_WR_PIN;
// // 	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);
// 	  GPIOD->BSRR = LCD_WR_PIN;
// // 	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
// //	  GPIOB->BSRR = LCD_CS1_PIN;
// }


void LCD_Init(void)
{
//	LCD_IOConfig();
//  FSMC_LCDInit();
// 	GPIO_ResetBits(LCD_RST_PORT, LCD_RST_PIN);
//		Delay_10ms(500);
  	GPIO_SetBits(LCD_RST_PORT, LCD_RST_PIN);
	
