cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
 	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
// 	  GPIO_ResetBits(LCD_CS2_PORT, LCD_CS2_PIN);
//  	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
//  	GPIO_SetBits(LCD_RD_PORT, LCD_RD_PIN);  //写数据 
//  	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);  //写数据 
	Delay_10ms(50);

  LCD_WR_REG(0x00E2);	
	Delay_10ms(1);
	LCD_WE_RAM(0x0023);
//	LCD_WE_RAM(0x001D);
	// Set PLL with OSC = 10MHz (hardware)
  // Multiplier N = 35, VCO (>250MHz)= OSC*(N+1), VCO = 360MHz	   
	Delay_10ms(1);
	LCD_WE_RAM(0x0002);
	// Divider M = 2, PLL = 360/(M+1) = 120MHz
	Delay_10ms(1);
	LCD_WE_RAM(0x0004);
//	LCD_WE_RAM(0x0054);
	// Validate M and N values
	Delay_10ms(500);

	LCD_WR_REG(0x00E0);                             // PLL enable
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);
	Delay_10ms(500);
	
	LCD_WR_REG(0x00E0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0003);
	Delay_10ms(5);
	
	LCD_WR_REG(0x0001);                             // software reset
	Delay_10ms(5);
	LCD_WR_REG(0x00E6);//设置像素时钟,33Mhz
//	LCD_WE_RAM(0x0004);
	Delay_10ms(1);
	LCD_WE_RAM(0x0002);//DWGL
	Delay_10ms(1);
	LCD_WE_RAM(0x0093);
	Delay_10ms(1);
	LCD_WE_RAM(0x00e0);

	LCD_WR_REG(0x00B0);	                             //LCD SPECIFICATION
//	LCD_WE_RAM(0x0000);//TFT panel data width  =0, 18-bit =1,24-bit 
//	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM(0x0020);//TFT panel data width  =0, 18-bit =1,24-bit 
//	LCD_WE_RAM(0x0060);
//	LCD_WE_RAM(0x0040);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM((HDP>>8)&0x00FF);                    //Set HDP
	Delay_10ms(1);
	LCD_WE_RAM(HDP&0X00FF);
	Delay_10ms(1);
  LCD_WE_RAM((VDP>>8)&0x00FF);                    //Set VDP
	Delay_10ms(1);
	LCD_WE_RAM(VDP&0X00FF);
	Delay_10ms(1);
  LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00B4);	                             //HSYNC
	Delay_10ms(1);
	LCD_WE_RAM((HT>>8)&0x00FF);                     //Set HT
	Delay_10ms(1);
	LCD_WE_RAM(HT&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM((HPS>>8)&0x00FF);                     //Set HPS
	Delay_10ms(1);
	LCD_WE_RAM(HPS&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM(HPW);			                            //Set HPW
	Delay_10ms(1);
	LCD_WE_RAM((LPS>>8)&0x00FF);                      //Set HPS
	Delay_10ms(1);
	LCD_WE_RAM(LPS&0x00FF);	
//	LCD_WE_RAM(0);                      //Set HPS
//	LCD_WE_RAM(0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00B6);	                              //VSYNC
	Delay_10ms(1);
	LCD_WE_RAM((VT>>8)&0x00FF);                       //Set VT
	Delay_10ms(1);
	LCD_WE_RAM(VT&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM((VPS>>8)&0x00FF);                       //Set VPS
	Delay_10ms(1);
	LCD_WE_RAM(VPS&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM(VPW);			                            //Set VPW
	Delay_10ms(1);
	LCD_WE_RAM((FPS>>8)&0x00FF);                      //Set FPS
	Delay_10ms(1);
	LCD_WE_RAM(FPS&0X00FF);
//	LCD_WE_RAM(0);                      //Set FPS
//	LCD_WE_RAM(0);

	Delay_10ms(1);
	LCD_WR_REG(0x002A);	                             //
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM((HDP>>8)&0x00FF);                    //Set HDP
	Delay_10ms(1);
	LCD_WE_RAM(HDP&0X00FF);
	
	
	Delay_10ms(1);
	LCD_WR_REG(0x002B);	                             //
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
  LCD_WE_RAM((VDP>>8)&0x00FF);                    //Set VDP
	Delay_10ms(1);
	LCD_WE_RAM(VDP&0X00FF);

	Delay_10ms(1);
	LCD_WR_REG(0x00BA);
	Delay_10ms(1);
	LCD_WE_RAM(0x0005);                               //GPIO[3:0] out 1

	Delay_10ms(1);
	LCD_WR_REG(0x00B8);
	Delay_10ms(1);
	LCD_WE_RAM(0x0007);                               //GPIO3=input, GPIO[2:0]=output
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);                               //GPIO0 normal

	Delay_10ms(1);
	LCD_WR_REG(0x0036);                                //rotation
	Delay_10ms(1);
	if(SET_XY1==1)
	{
LCD_WE_RAM(0x0040);//dwgl				//横屏1
//LCD_WE_RAM(0x0004);//dwgl				//横屏1
//LCD_WE_RAM(0x0006);//dwgl				//横屏1
//LCD_WE_RAM(0x0002);//dwgl				//横屏1
//LCD_WE_RAM(0x0042);//dwgl				//横屏1
	}
	else
	if(SET_XY1==2)
	{
//	LCD_WE_RAM(0x0086);								//横屏2
	LCD_WE_RAM(0x0080);								//横屏2
	}
	else
	if(SET_XY1==3)
	{
	 LCD_WE_RAM(0x0023);//AC       //竖屏1
//	 LCD_WE_RAM(0x0020);//AC       //竖屏1
//	 LCD_WE_RAM(0x0024);//AC       //竖屏1
//	 LCD_WE_RAM(0x0030);//AC       //竖屏1
	}
	else
	if(SET_XY1==4)
	{
//	 LCD_WE_RAM(0x00AC);//AC       //竖屏2
//	 LCD_WE_RAM(0x00a0);//AC       //竖屏2
	 LCD_WE_RAM(0x0030);//AC       //竖屏2
	}
//LCD_WE_RAM(0x0000);//dwgl				//横屏1
//	LCD_WE_RAM(0x0086);						//横屏2
//	 LCD_WE_RAM(0x00AB);//AC       //竖屏1
//	 LCD_WE_RAM(0x00AC);//AC       //竖屏2
			
	Delay_10ms(1);
	LCD_WR_REG(0x00F0);                               //pixel data interface
	Delay_10ms(1);
	LCD_WE_RAM(0x0003);


	Delay_10ms(5);
	LCD_WR_REG(0x0029);                                //display on

	Delay_10ms(1);
	LCD_WR_REG(0x00BE);                                //set PWM for B/L
	Delay_10ms(1);
	LCD_WE_RAM(0x0006);
	Delay_10ms(1);
	LCD_WE_RAM(0x0080);
	
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);
	Delay_10ms(1);
	LCD_WE_RAM(0x00f0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00d0);                               //设置动态背光控制配置 
	Delay_10ms(1);
	LCD_WE_RAM(0x000d);


	Delay_10ms(5);	                                   //延时50ms
//	LCD_Clear(RED);

	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
//	GPIO_SetBits(LCD_CS2_PORT, LCD_CS2_PIN);
	
}
void LCD_Init1(void)
{
//	LCD_IOConfig();
//  FSMC_LCDInit();
// 	GPIO_ResetBits(LCD_RST_PORT, LCD_RST_PIN);
//		Delay_10ms(500);
  	GPIO_SetBits(LCD_RST_PORT, LCD_RST_PIN);
	
// 	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
 	GPIO_ResetBits(LCD_CS2_PORT, LCD_CS2_PIN);
//  	GPIO_SetBits(LCD_RS_PORT, LCD_RS_PIN);  //写数据 
//  	GPIO_SetBits(LCD_RD_PORT, LCD_RD_PIN);  //写数据 
//  	GPIO_SetBits(LCD_WR_PORT, LCD_WR_PIN);  //写数据 
	Delay_10ms(50);

  LCD_WR_REG(0x00E2);	
	Delay_10ms(1);
	LCD_WE_RAM(0x0023);
//	LCD_WE_RAM(0x001D);
	// Set PLL with OSC = 10MHz (hardware)
  // Multiplier N = 35, VCO (>250MHz)= OSC*(N+1), VCO = 360MHz	   
	Delay_10ms(1);
	LCD_WE_RAM(0x0002);
	// Divider M = 2, PLL = 360/(M+1) = 120MHz
	Delay_10ms(1);
	LCD_WE_RAM(0x0004);
//	LCD_WE_RAM(0x0054);
	// Validate M and N values
	Delay_10ms(500);

