cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
	LCD_WR_REG(0x00E0);                             // PLL enable
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);
	Delay_10ms(500);
	
	LCD_WR_REG(0x00E0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0003);
	Delay_10ms(5);
	
	LCD_WR_REG(0x0001);                             // software reset
	Delay_10ms(5);
	LCD_WR_REG(0x00E6);//设置像素时钟,33Mhz
//	LCD_WE_RAM(0x0004);
	Delay_10ms(1);
	LCD_WE_RAM(0x0002);//DWGL
	Delay_10ms(1);
	LCD_WE_RAM(0x0093);
	Delay_10ms(1);
	LCD_WE_RAM(0x00e0);

	LCD_WR_REG(0x00B0);	                             //LCD SPECIFICATION
//	LCD_WE_RAM(0x0000);//TFT panel data width  =0, 18-bit =1,24-bit 
//	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM(0x0020);//TFT panel data width  =0, 18-bit =1,24-bit 
//	LCD_WE_RAM(0x0060);
//	LCD_WE_RAM(0x0040);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM((HDP>>8)&0x00FF);                    //Set HDP
	Delay_10ms(1);
	LCD_WE_RAM(HDP&0X00FF);
	Delay_10ms(1);
  LCD_WE_RAM((VDP>>8)&0x00FF);                    //Set VDP
	Delay_10ms(1);
	LCD_WE_RAM(VDP&0X00FF);
	Delay_10ms(1);
  LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00B4);	                             //HSYNC
	Delay_10ms(1);
	LCD_WE_RAM((HT>>8)&0x00FF);                     //Set HT
	Delay_10ms(1);
	LCD_WE_RAM(HT&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM((HPS>>8)&0x00FF);                     //Set HPS
	Delay_10ms(1);
	LCD_WE_RAM(HPS&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM(HPW);			                            //Set HPW
	Delay_10ms(1);
	LCD_WE_RAM((LPS>>8)&0x00FF);                      //Set HPS
	Delay_10ms(1);
	LCD_WE_RAM(LPS&0x00FF);	
//	LCD_WE_RAM(0);                      //Set HPS
//	LCD_WE_RAM(0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00B6);	                              //VSYNC
	Delay_10ms(1);
	LCD_WE_RAM((VT>>8)&0x00FF);                       //Set VT
	Delay_10ms(1);
	LCD_WE_RAM(VT&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM((VPS>>8)&0x00FF);                       //Set VPS
	Delay_10ms(1);
	LCD_WE_RAM(VPS&0x00FF);
	Delay_10ms(1);
	LCD_WE_RAM(VPW);			                            //Set VPW
	Delay_10ms(1);
	LCD_WE_RAM((FPS>>8)&0x00FF);                      //Set FPS
	Delay_10ms(1);
	LCD_WE_RAM(FPS&0X00FF);
//	LCD_WE_RAM(0);                      //Set FPS
//	LCD_WE_RAM(0);

	Delay_10ms(1);
	LCD_WR_REG(0x002A);	                             //
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM((HDP>>8)&0x00FF);                    //Set HDP
	Delay_10ms(1);
	LCD_WE_RAM(HDP&0X00FF);
	
	
	Delay_10ms(1);
	LCD_WR_REG(0x002B);	                             //
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);//
	Delay_10ms(1);
  LCD_WE_RAM((VDP>>8)&0x00FF);                    //Set VDP
	Delay_10ms(1);
	LCD_WE_RAM(VDP&0X00FF);

	Delay_10ms(1);
	LCD_WR_REG(0x00BA);
	Delay_10ms(1);
	LCD_WE_RAM(0x0005);                               //GPIO[3:0] out 1

	Delay_10ms(1);
	LCD_WR_REG(0x00B8);
	Delay_10ms(1);
	LCD_WE_RAM(0x0007);                               //GPIO3=input, GPIO[2:0]=output
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);                               //GPIO0 normal

	Delay_10ms(1);
	LCD_WR_REG(0x0036);                                //rotation
	Delay_10ms(1);
	if(SET_XY1==1)
	{
LCD_WE_RAM(0x0040);//dwgl				//横屏1
//LCD_WE_RAM(0x0004);//dwgl				//横屏1
//LCD_WE_RAM(0x0006);//dwgl				//横屏1
//LCD_WE_RAM(0x0002);//dwgl				//横屏1
//LCD_WE_RAM(0x0042);//dwgl				//横屏1
	}
	else
	if(SET_XY1==2)
	{
//	LCD_WE_RAM(0x0086);								//横屏2
	LCD_WE_RAM(0x0080);								//横屏2
	}
	else
	if(SET_XY1==3)
	{
	 LCD_WE_RAM(0x0023);//AC       //竖屏1
//	 LCD_WE_RAM(0x0020);//AC       //竖屏1
//	 LCD_WE_RAM(0x0024);//AC       //竖屏1
//	 LCD_WE_RAM(0x0030);//AC       //竖屏1
	}
	else
	if(SET_XY1==4)
	{
//	 LCD_WE_RAM(0x00AC);//AC       //竖屏2
//	 LCD_WE_RAM(0x00a0);//AC       //竖屏2
	 LCD_WE_RAM(0x0030);//AC       //竖屏2
	}
//LCD_WE_RAM(0x0000);//dwgl				//横屏1
//	LCD_WE_RAM(0x0086);						//横屏2
//	 LCD_WE_RAM(0x00AB);//AC       //竖屏1
//	 LCD_WE_RAM(0x00AC);//AC       //竖屏2
			
	Delay_10ms(1);
	LCD_WR_REG(0x00F0);                               //pixel data interface
	Delay_10ms(1);
	LCD_WE_RAM(0x0003);


	Delay_10ms(5);
	LCD_WR_REG(0x0029);                                //display on

	Delay_10ms(1);
	LCD_WR_REG(0x00BE);                                //set PWM for B/L
	Delay_10ms(1);
	LCD_WE_RAM(0x0006);
	Delay_10ms(1);
	LCD_WE_RAM(0x0080);
	
	Delay_10ms(1);
	LCD_WE_RAM(0x0001);
	Delay_10ms(1);
	LCD_WE_RAM(0x00f0);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);
	Delay_10ms(1);
	LCD_WE_RAM(0x0000);

	Delay_10ms(1);
	LCD_WR_REG(0x00d0);                               //设置动态背光控制配置 
	Delay_10ms(1);
	LCD_WE_RAM(0x000d);


	Delay_10ms(5);	                                   //延时50ms
//	LCD_Clear(RED);
	
//	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
	GPIO_SetBits(LCD_CS2_PORT, LCD_CS2_PIN);
	
}
/************************************************************************
** Function name:       void LCD_SetCursor(u16 Xpos, u16 Ypos)
** Descriptions:        设置光标位置
** input parameters:    x轴坐标：uint16_t Xpos ;  y轴坐标：uint16_t Ypos
** output parameters:   无
** Returned value:      无
**************************************************************************/
void LCD_SetCursor(u16 Xpos, u16 Ypos)
{		
	LCD_WR_REG(0x002A);	
	LCD_WE_RAM(Xpos>>8);	    
	LCD_WE_RAM(Xpos&0x00ff);
	LCD_WE_RAM(HDP>>8);	    
	LCD_WE_RAM(HDP&0x00ff);
	
  LCD_WR_REG(0x002b);	
	LCD_WE_RAM(Ypos>>8);	    
	LCD_WE_RAM(Ypos&0x00ff);
	LCD_WE_RAM(VDP>>8);	    
	LCD_WE_RAM(VDP&0x00ff);
}

/****************************************************************************
* 名    称：u16 LCD_GetPoint(u16 x,u16 y)
* 功    能：获取指定座标的颜色值
* 入口参数：x      行座标
*           y      列座标
* 出口参数：当前座标颜色值
* 说    明：
* 调用方法：CurrentColor = LCD_GetPoint(10,10);
****************************************************************************/
u16 LCD_GetPoint(u16 x,u16 y)
{
	u16 temp;
	
	LCD_SetCursor(x,y);
	LCD_WR_REG(0x2C);
	LCD_WR_REG(0x2E);

	temp = LCD_ReadRAM();
	return temp;	
}

/***********************************************************************
** Function name:       void LCD_DrawPoint(uint16_t xsta, uint16_t ysta)
** Descriptions:        打点
** input parameters:    xsta X起始坐标 0~480;ysta	Y起始坐标 0~272
** output parameters:   无
** Returned value:      无
***********************************************************************/
void LCD_DrawPoint(uint16_t xsta, uint16_t ysta)
{
	LCD_SetCursor(xsta,ysta);           //设置光标位置  
	LCD_WR_REG(0x2C);                   //开始写入GRAM 
	LCD_WE_RAM(POINT_COLOR); 
}

/*******************************************************************************************************
** Function name:       void LCD_WindowMax (unsigned int x,unsigned int y,unsigned int x_end,unsigned int y_end) 
** Descriptions:        设置窗口最大化480*272
** input parameters:    xsta X起始坐标 0~480;ysta	Y起始坐标 0~272
** output parameters:   无
** Returned value:      无
******************************************************************************************************/
void LCD_WindowMax (unsigned int x,unsigned int y,unsigned int x_end,unsigned int y_end) 
{
	LCD_WR_REG(0x002A);
	LCD_WE_RAM(x>>8);
	LCD_WE_RAM(x&0x00FF);
	LCD_WE_RAM(x_end>>8);
	LCD_WE_RAM(x_end&0x00FF);
		
	LCD_WR_REG(0x002B);	
	LCD_WE_RAM(y>>8);	
	LCD_WE_RAM(y&0x00FF);
	LCD_WE_RAM(y_end>>8);	
	LCD_WE_RAM(y_end&0x00FF);			
 
