cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
}

/***********************************************************
** Function name:       void LCD_Clear(uint16_t Color)
** Descriptions:        刷屏函数
** input parameters:    颜色值
** output parameters:   无
** Returned value:      无
************************************************************/
void LCD_Clear(uint16_t Color)
{
//	uint16_t index=0; 
	uint16_t j; 
  u16 length=LCD_H;	
	LCD_WindowMax(0,0,HDP,VDP);          //设置显示窗口
	LCD_WriteRAM_Prepare();              //开始写入GRAM	  
	while(length--)
	{
//	for(i=0;i<(LCD_H);i++)//DWGL
		{
		for(j=0;j<(LCD_W);j++)//DWGL
	  {
		  LCD_WE_RAM(Color);	
	  }
	}
	}
}

void LCD_Clear_S(uint16_t Color)
{
//	uint16_t index=0; 
	uint16_t j; 
  u16 length=LCD_H;	
	LCD_WindowMax(0,0,HDP,VDP);          //设置显示窗口
	LCD_WriteRAM_Prepare();              //开始写入GRAM	  
	while(length--)
	{
//	for(i=0;i<(LCD_H);i++)//DWGL
		{
		for(j=0;j<(LCD_W);j++)//DWGL
	  {
		  LCD_WE_RAM(Color);	
	  }
	}
	}
}

/*************************************************************************************************************
** Function name:       void LCD_Fill(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend, uint16_t colour)
** Descriptions:        在指定矩形区域填充指定颜色，区域大小(xend-xsta)*(yend-ysta)
** input parameters:    xsta 起始X坐标
		                    ysta 起始Y坐标
		                    xend 结束X坐标
		                    yend 结束Y坐标
		                    color 待填充颜色
** output parameters:   无
** Returned value:      无
**************************************************************************************************************/
void LCD_Fill(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend, uint16_t colour)
{                    	
	u32 n;
	LCD_WindowMax (xsta, ysta, xend, yend);       //设置窗口	
	LCD_WriteRAM_Prepare();                       //开始写入GRAM*6 	   	   
	n=(u32)(yend-ysta+1)*(xend-xsta+1);     
  while(n--){LCD_WE_RAM(colour);}               //显示所填充的颜色
	 
	LCD_WindowMax (0, 0, LCD_W, LCD_H);      	    //恢复窗口
}  


/****************************************************************************************************
** Function name:       void LCD_DrawLine(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend)
** Descriptions:        画线
** input parameters:    xsta X起始坐标
	   	                  ysta Y起始坐标
		                    xend X终点坐标
		                    yend Y终点坐标	
** output parameters:   无
** Returned value:      无
****************************************************************************************************/
void LCD_DrawLine(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend)
{
  u16 x, y, t;
	if((xsta==xend)&&(ysta==yend))LCD_DrawPoint(xsta, ysta);
	else if(abs(yend-ysta)>abs(xend-xsta))                    //斜率大于1 
	{
		if(ysta>yend) 
		{
			t=ysta;
			ysta=yend;
			yend=t; 
			t=xsta;
			xsta=xend;
			xend=t; 
		}
		for(y=ysta;y<yend;y++)                                   //以y轴为基准 
		{
			x=(u32)(y-ysta)*(xend-xsta)/(yend-ysta)+xsta;
			LCD_DrawPoint(x, y);  
		}
	}
	else                                                       //斜率小于等于1 
	{
		if(xsta>xend)
		{
			t=ysta;
			ysta=yend;
			yend=t;
			t=xsta;
			xsta=xend;
			xend=t;
		}   
		for(x=xsta;x<=xend;x++)                                   //以x轴为基准
		{
			y =(u32)(x-xsta)*(yend-ysta)/(xend-xsta)+ysta;
			LCD_DrawPoint(x,y); 
		}
	} 
} 

/****************************************************************************************************
** Function name:       void LCD_DrawHVLine(uint16_t xsta, uint16_t ysta, uint16_t Length,uint16_t Color,uint8_t Direction)
** Descriptions:        绘制水平或垂直的线条
** input parameters:    xsta X起始坐标
	   	                  ysta Y起始坐标
		                    Length 线条长度
		                    Color 线条颜色
                        Direction: Horizontal 水平; Vertical 垂直
** output parameters:   无
** Returned value:      无
****************************************************************************************************/
void LCD_DrawHVLine(uint16_t xsta, uint16_t ysta, uint16_t Length,uint16_t Color,uint8_t Direction)
{
  uint32_t i = 0;
  
  LCD_SetCursor(xsta, ysta);

  if(Direction == Horizontal)
  {
    LCD_WriteRAM_Prepare();                                //Prepare to write GRAM 
    for(i = 0; i < Length; i++)
    {
      LCD_WE_RAM(Color);
    }
  }
  else
  {
    for(i = 0; i < Length; i++)
    {
			
      LCD_WriteRAM_Prepare();                               //Prepare to write GRAM 
      LCD_WE_RAM(Color);
      xsta++;
      LCD_SetCursor(xsta, ysta);
    }
  }
}

/*****************************************************************************
** Function name:       void LCD_DrawCircle(uint16_t x0, uint16_t y0, uint8_t r)
** Descriptions:        画圆
** input parameters:    x0 中心点横坐标
	                      y0 中心点纵坐标
		                    r  半径
** output parameters:   无
** Returned value:      无
******************************************************************************/
void LCD_DrawCircle(uint16_t x0, uint16_t y0, uint8_t r)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);                                        //判断下个点位置的标志
	while(a<=b)
	{
		LCD_DrawPoint(x0-b,y0-a);                         //3           
		LCD_DrawPoint(x0+b,y0-a);                         //0           
		LCD_DrawPoint(x0-a,y0+b);                         //1       
		LCD_DrawPoint(x0-b,y0-a);                         //7           
		LCD_DrawPoint(x0-a,y0-b);                         //2             
		LCD_DrawPoint(x0+b,y0+a);                         //4               
		LCD_DrawPoint(x0+a,y0-b);                         //5
		LCD_DrawPoint(x0+a,y0+b);                         //6 
		LCD_DrawPoint(x0-b,y0+a);             
		a++;

		/*使用Bresenham算法画圆*/     
		if(di<0)di +=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 
		LCD_DrawPoint(x0+a,y0+b);
	}
} 

/*****************************************************************************
** Function name:       void Draw_Circle(uint16_t x0, uint16_t y0, uint8_t r)
** Descriptions:        画矩形
** input parameters:    xsta X起始坐标
	                      ysta Y起始坐标
		                    xend X结束坐标
		                    yend Y结束坐标
** output parameters:   无
** Returned value:      无
******************************************************************************/
void LCD_DrawRectangle(uint16_t xsta, uint16_t ysta, uint16_t xend, uint16_t yend)
{
	LCD_DrawLine(xsta,ysta,xend,ysta);
	LCD_DrawLine(xsta,ysta,xsta,yend);
	LCD_DrawLine(xsta,yend,xend,yend);
	LCD_DrawLine(xend,ysta,xend,yend);
} 

/***************************************************************************************************
** Function name:       void LCD_ShowChar(u16 x, u16 y, u8 num, u8 size, u16 PenColor, u16 BackColor)
** Descriptions:        显示一个字符
** input parameters:    x，y      起始坐标（x:0~480 y:0~272）
		                    num       字符ASCII码值
		                    size      字符大小，使用默认8*16
		                    PenColor  字体颜色
		                    BackColor 字体背景颜色
** output parameters:   无
** Returned value:      无
****************************************************************************************************/
void LCD_ShowChar(u16 x, u16 y, u8 num, u8 size, u16 PenColor, u16 BackColor)
{       
  u8 temp;
  u8 pos,t;
  if(x>MAX_CHAR_POSX||y>MAX_CHAR_POSY)return;		 
  
	if(XY)                                             //横屏显示
 	 {	
 		 LCD_WindowMax(x,y,x+size/2-1,y+size-1);	        //设置窗口
 	 }
   else                                                  //竖屏显示
 	 {
		  LCD_WR_REG(0x0036); //rotation
	    LCD_WE_RAM(0x00AB);//AC
			LCD_WindowMax(x,y-size/2,x+size-1,y-1);	           //设置窗口		
 	 }  
	
	LCD_WriteRAM_Prepare();                                //开始写入GRAM   
	num=num-' ';                                            //得到偏移后的值 
	for(pos=0;pos<size;pos++)
	{
// 		if(size==12)temp=asc2_1206[num][pos];                  //调用1206字体		
// 		else temp=asc2_1608[num][pos];		                     //调用1608字体
			
		for(t=0;t<size/2;t++)
	  {                 
	    if(temp&0x01)			                                   //从低位开始
			 {
				 LCD_WE_RAM(PenColor);                             //画字体颜色 一个点
			 }
			 else 
			 {
				 LCD_WE_RAM(BackColor);	                           //画背景颜色 一个点      
			 }
			temp>>=1; 
	  }
	}			
	LCD_WindowMax(0x0000,0x0000,LCD_W,LCD_H);	                //恢复窗体大小
}

/**********************************************************************************
** Function name:       unsigned int mypow(unsigned int m,unsigned int n)
** Descriptions:        m的n次方 用于取出数值每一位
** input parameters:  	m进制：unsigned int m
**											n次方：unsigned int n						
** output parameters:   m^n
** Returned value:      无
************************************************************************************/
u32 mypow(u8 m,u8 n)
{
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}			 
 
/*********************************************************************************************
** Function name:       void LCD_ShowNum(u16 x,u16 y,u32 num,u8 len, u16 PenColor, u16 BackColor)
** Descriptions:        显示数字(0~4294967295);
** input parameters:  	x起始：     u16 x
  											y起始：     u16 y
  											数值:       num
    										有效长度：  len		
                        字体颜色:   PenColor
                        背景颜色：  BackColor
** output parameters:   无
** Returned value:      无
************************************************************************************************/
void LCD_ShowNum(u16 x,u16 y,u32 num,u8 len, u16 PenColor, u16 BackColor)
{    
	u8 size = 16;                                          // 这里使用默认的16*8       	
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/mypow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				LCD_ShowChar(x+(size/2)*t,y,' ',size, PenColor, BackColor);
				LCD_ShowChar(x+(size/2)*t,y,'0',size, PenColor, BackColor);
				continue;
			}else enshow=1; 
		 	 
