cckjdwgl/charge_11PA/charge_ctrl_stm32_BL/User/lcd/dwgl_WB_LCD.c
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size, PenColor, BackColor); 
	}
} 
  

/*********************************************************************************************
** Function name:       void LCD_ShowCharString(uint16_t x, uint16_t y, const uint8_t *p, uint16_t PenColor, uint16_t BackColor)
** Descriptions:        显示字符(此函数不能单独调用)
** input parameters:  	x，y      起始坐标
	                      p         指向字符串起始地址
		                    PenColor  字符颜色
		                    BackColor 背景颜色
** output parameters:   无
** Returned value:      无
************************************************************************************************/
void LCD_ShowCharString(uint16_t x, uint16_t y, const uint8_t *p, uint16_t PenColor, uint16_t BackColor)
{   
	uint8_t size = 16;                                    //字符大小默认16*8
	 
    if(x>MAX_CHAR_POSX){x=0;y+=size;}			              //超出X轴字体最小单位，换行
    if(y>MAX_CHAR_POSY){y=x=0;LCD_Clear(WHITE);}	      //超出Y轴字体最小单位，回到原点，并且清屏
    LCD_ShowChar(x, y, *p, size, PenColor, BackColor);	//0表示非叠加方式
 
}


/**********************************************************************************
** Function name:       u16 findHzIndex(u8 *hz) 
** Descriptions:        索引汉字存储的内存地址
** input parameters:  	hz				
** output parameters:   无
** Returned value:      无
************************************************************************************/
u16 findHzIndex(u8 *hz)                               // 在自定义汉字库在查找所要显示 
                                                      // 的汉字的位置 
{
// 	u16 i=0;
// 	FNT_GB16 *ptGb16 = (FNT_GB16 *)GBHZ_16;		          //ptGb16指向GBHZ_16
// 	while(ptGb16[i].Index[0] > 0x80)
// 	{
// 	  if ((*hz == ptGb16[i].Index[0]) && (*(hz+1) == ptGb16[i].Index[1])) //汉字用两位来表示地址码
// 		{
// 	    return i;
// 	  }
// 	  i++;
// 	  if(i > (sizeof((FNT_GB16 *)GBHZ_16) / sizeof(FNT_GB16) - 1))  //搜索下标约束 
// 	  {
// 		  break;
// 	  }
// 	}
 	return 0;
}


/************************************************************************************************
** Function name:       void WriteOneHz(u16 x0, u16 y0, u8 *pucMsk, u16 PenColor, u16 BackColor)
** Descriptions:        显示一个汉字(此函数不能单独作为汉字字符显示)
** input parameters:  	x0,y0      起始坐标
		                    *pucMsk    指向字符串地址
		                    PenColor	 字符颜色
		                    BackColor  背景颜色			
** output parameters:   无
** Returned value:      无
************************************************************************************************/
void WriteOneHz(u16 x0, u16 y0, u8 *pucMsk, u16 PenColor, u16 BackColor)
{
   u16 i,j;
   u16 mod[16];                                      //当前字模 16*16 
   u16 *pusMsk;                                      //当前字库地址  
   u16 y;

	 u16 size = 16;                                      //汉字默认大小16*16

    pusMsk = (u16 *)pucMsk;

    for(i=0; i<16; i++)                                //保存当前汉字点阵式字模 
    {
      mod[i] = *pusMsk;                              //取得当前字模，半字对齐访问   
      mod[i] = ((mod[i] & 0xff00) >> 8) | ((mod[i] & 0x00ff) << 8);//字模交换高低字节
		  pusMsk = pusMsk+1;
    }
    y = x0;		  
		if(XY)                                            //横屏显示
 	  {
 		  LCD_WindowMax(x0,y0,x0+size-1,y0+size-1);	       //设置窗口
 		  
 	  }
     else                                                //竖屏显示
 	   {
 		 	LCD_WR_REG(0x0036); //rotation
	    LCD_WE_RAM(0x00AB);  //AC
			LCD_WindowMax(x0,y0-size,x0+size-1,y0-1);	       //设置窗口		
 	   }  
                               
	  LCD_WriteRAM_Prepare();                              //开始写入GRAM  
    for(i=0; i<16; i++)                                   //16行 
    {                                              
      for(j=0; j<16; j++)                                 //16列  
       {
		    if((mod[i] << j) & 0x8000)                     //显示第i行 共16个点 
         { 
			     LCD_WE_RAM(PenColor);
         } 
			   else 
			   {
           LCD_WE_RAM(BackColor);                   //用读方式跳过写空白点的像素
			   } 
       }
        y++;
    }
	LCD_WindowMax(0x0000,0x0000,LCD_W,LCD_H);  	             //恢复窗体大小
}

/**********************************************************************************
** Function name:       void LCD_ShowHzString(u16 x0, u16 y0, u8 *pcStr, u16 PenColor, u16 BackColor)
** Descriptions:        显示汉字字符串(不能单独调用)
** input parameters:  	x0，y0    起始坐标
		                    pcStr     指向字符串地址
		                    PenColor  字体颜色
		                    BackColor 字体背景				
** output parameters:   无
** Returned value:      无
************************************************************************************/
void LCD_ShowHzString(u16 x0, u16 y0, u8 *pcStr, u16 PenColor, u16 BackColor)
{

// 	u16 usIndex;
// 	u8 size = 16; 
// 	FNT_GB16 *ptGb16 = 0;    
//   ptGb16 = (FNT_GB16 *)GBHZ_16; 

// 	if(x0>MAX_HZ_POSX){x0=0;y0+=size;}			            //超出X轴字体最小单位，换行
//   // if(y0>MAX_HZ_POSY){y0=x0=0;LCD_Clear(WHITE);}	    //超出Y轴字体最小单位，回到原点，并且清屏

// 	usIndex = findHzIndex(pcStr);
// 	WriteOneHz(x0, y0, (u8 *)&(ptGb16[usIndex].Msk[0]),  PenColor, BackColor); //显示一个汉字
}

/**********************************************************************************
** Function name:       void LCD_DisplayStr(unsigned int x, unsigned int y, unsigned char *s,u16 PenColor, u16 BackColor)
** Descriptions:        显示字符串(可以和汉字混合显示,支持横竖屏切换)
** input parameters:  	x，y    起始坐标
		                    *s     指向字符串地址
		                    PenColor  字体颜色
		                    BackColor 字体背景				
** output parameters:   无
** Returned value:      无
************************************************************************************/
void LCD_DisplayStr(unsigned int x, unsigned int y, unsigned char *s,u16 PenColor, u16 BackColor) 
{
	if(XY==0)
	{
		u16 change=0;
	  change=x;
	  x=y;
	  y=change;
	}
  while (*s) 
	{  	
		if(*s>0x80)                                            //显示汉字
		{
			if(XY)
		  {	
				LCD_ShowHzString(x, y, s, PenColor, BackColor);		
			  x += 16;
			}
			else	
			{
				LCD_ShowHzString(x, LCD_H-y, s, PenColor, BackColor);

			  y += 16;
			}
		  s += 2;
		}
  	else                                                 //非汉字
		{		
		 if(XY)                                               //横屏显示
		 {
		   LCD_ShowChar(x, y, *s++, 16, PenColor, BackColor);
			 x+=Font_Size/2;
			 if(x>=MAX_CHAR_POSX)
			 {
				x=0;
				y+=Font_Size;
				if(y>=MAX_CHAR_POSY)y=0;
			 }
		 }
		 else                                                  //竖屏显示
		 {
			 LCD_ShowChar(x, LCD_H-y, *s++, 16, PenColor, BackColor);
			 y+=Font_Size/2;
			 if(y>=MAX_CHAR_POSX)
			 {
				 y=0;
				 x+=Font_Size;
				 if(x>=MAX_CHAR_POSY)y=0;
			 }
		}
  }
  }
}

/**********************************************************************************
** Function name:       u16 LCD_RGBtoBGR(u16 Color)
** Descriptions:        RRRRRGGGGGGBBBBB 改为 BBBBBGGGGGGRRRRR 格式
** input parameters:  	Color      RGB 颜色值		
** output parameters:   BGR 颜色值
** Returned value:      无
************************************************************************************/
u16 LCD_RGBtoBGR(u16 Color)
{						   
  u16  r, g, b, bgr;

  b = (Color>>0)  & 0x1f;	                    //提取B 
  g = (Color>>5)  & 0x3f;	                    //中间六位
  r = (Color>>11) & 0x1f;	                    //提取R  
  
  bgr =  (b<<11) + (g<<5) + (r<<0);

  return( bgr );
}


/**********************************************************************************
** Function name:       void LCD_DrawPicture(u16 StartX,u16 StartY,u16 Xend,u16 Yend,u8 *pic)
** Descriptions:        图片取模格式为水平扫描，16位颜色模式
** input parameters:  	StartX     行起始座标
                        StartY     列起始座标
                        EndX       行结束座标
                        EndY       列结束座标
                        pic        图片头指针	
** output parameters:   无
** Returned value:      无
************************************************************************************/
void LCD_DrawPicture(u16 StartX,u16 StartY,u16 Xend,u16 Yend,u8 *pic)
{
	static	u16 i=0,j=0;
	u16 *bitmap = (u16 *)pic;

	LCD_WindowMax(StartX, StartY, Xend-1, Yend-1);	//设置图片显示窗口大小
	 
	LCD_WriteRAM_Prepare();
	for(j=0; j<Yend-StartY; j++)
	{
		for(i=0; i<Xend-StartX; i++) LCD_WE_RAM(*bitmap++); 	
	}
	
	LCD_WindowMax(0, 0, LCD_W, LCD_H);              //恢复窗口
}

